# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azapi_resource.whoami will be created
  + resource "azapi_resource" "whoami" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + whoami = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/whoami"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "whoami"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # kubectl_manifest.flux_cert_manager_helm_release will be destroyed
  # (because kubectl_manifest.flux_cert_manager_helm_release is not in configuration)
  - resource "kubectl_manifest" "flux_cert_manager_helm_release" {
      - api_version             = "helm.toolkit.fluxcd.io/v2" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/helm.toolkit.fluxcd.io/v2/namespaces/cert-manager/helmreleases/cert-manager" -> null
      - kind                    = "HelmRelease" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "945d256c-f183-431f-af67-3bdf3be7ea27" -> null
      - name                    = "cert-manager" -> null
      - namespace               = "cert-manager" -> null
      - server_side_apply       = false -> null
      - uid                     = "945d256c-f183-431f-af67-3bdf3be7ea27" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: helm.toolkit.fluxcd.io/v2
            kind: HelmRelease
            metadata:
              name: cert-manager
              namespace: cert-manager
            spec:
              chart:
                spec:
                  chart: cert-manager
                  interval: 12h
                  sourceRef:
                    kind: HelmRepository
                    name: cert-manager
                    namespace: cert-manager
                  version: 1.17.x
              interval: 30m
              values:
                installCRDs: true
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_cert_manager_helm_repository will be destroyed
  # (because kubectl_manifest.flux_cert_manager_helm_repository is not in configuration)
  - resource "kubectl_manifest" "flux_cert_manager_helm_repository" {
      - api_version             = "source.toolkit.fluxcd.io/v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/source.toolkit.fluxcd.io/v1/namespaces/cert-manager/helmrepositorys/cert-manager" -> null
      - kind                    = "HelmRepository" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "471569bf-9dde-40c4-8945-929dae50c844" -> null
      - name                    = "cert-manager" -> null
      - namespace               = "cert-manager" -> null
      - server_side_apply       = false -> null
      - uid                     = "471569bf-9dde-40c4-8945-929dae50c844" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1
            kind: HelmRepository
            metadata:
              name: cert-manager
              namespace: cert-manager
            spec:
              interval: 24h
              url: https://charts.jetstack.io
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_cwert_manger_namespace will be destroyed
  # (because kubectl_manifest.flux_cwert_manger_namespace is not in configuration)
  - resource "kubectl_manifest" "flux_cwert_manger_namespace" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/cert-manager" -> null
      - kind                    = "Namespace" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "4c44d120-83d6-44a7-aead-373f82459bab" -> null
      - name                    = "cert-manager" -> null
      - server_side_apply       = false -> null
      - uid                     = "4c44d120-83d6-44a7-aead-373f82459bab" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: cert-manager
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_dis_apim_dev_kustomization will be destroyed
  # (because kubectl_manifest.flux_dis_apim_dev_kustomization is not in configuration)
  - resource "kubectl_manifest" "flux_dis_apim_dev_kustomization" {
      - api_version             = "kustomize.toolkit.fluxcd.io/v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/kustomize.toolkit.fluxcd.io/v1/namespaces/flux-system/kustomizations/dis-apim" -> null
      - kind                    = "Kustomization" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "87d9d52e-4f6d-4851-ae5a-f1c25a8aa70c" -> null
      - name                    = "dis-apim" -> null
      - namespace               = "flux-system" -> null
      - server_side_apply       = false -> null
      - uid                     = "87d9d52e-4f6d-4851-ae5a-f1c25a8aa70c" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: kustomize.toolkit.fluxcd.io/v1
            kind: Kustomization
            metadata:
              name: dis-apim
              namespace: flux-system
            spec:
              images:
              - name: controller
                newName: ghcr.io/altinn/altinn-platform/dis-apim-operator
                newTag: latest
              interval: 5m
              patches:
              - patch: |-
                  - op: add
                    path: /metadata/annotations
                    value:
                      azure.workload.identity/client-id: "2042ea24-38f1-467d-80b3-55bf76faf45e"
                target:
                  kind: ServiceAccount
                  name: controller-manager
              - patch: "- op: add
  path: /spec/template/spec/containers/0/env
  value:
    -
                  name: DISAPIM_SUBSCRIPTION_ID
      value: 1ce8e9af-c2d6-44e7-9c5e-099a308056fe

                     - name: DISAPIM_RESOURCE_GROUP
      value: "altinn-apim-test-rg"
    -
                  name: DISAPIM_APIM_SERVICE_NAME
      value: "altinn-apim-test-apim"
- op:
                  add
  path: /spec/template/metadata/labels/azure.workload.identity~1use
  value:
                  "true"    "
                target:
                  kind: Deployment
              path: ./default
              prune: true
              retryInterval: 5m
              sourceRef:
                kind: OCIRepository
                name: dis-apim
              targetNamespace: dis-apim-operator-system
              timeout: 10m
              wait: true
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_dis_apim_ocirepo will be destroyed
  # (because kubectl_manifest.flux_dis_apim_ocirepo is not in configuration)
  - resource "kubectl_manifest" "flux_dis_apim_ocirepo" {
      - api_version             = "source.toolkit.fluxcd.io/v1beta2" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/source.toolkit.fluxcd.io/v1beta2/namespaces/flux-system/ocirepositorys/dis-apim" -> null
      - kind                    = "OCIRepository" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "413b44d4-e7b5-45c0-a9e9-d9de6e4a9c48" -> null
      - name                    = "dis-apim" -> null
      - namespace               = "flux-system" -> null
      - server_side_apply       = false -> null
      - uid                     = "413b44d4-e7b5-45c0-a9e9-d9de6e4a9c48" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1beta2
            kind: OCIRepository
            metadata:
              name: dis-apim
              namespace: flux-system
            spec:
              interval: 5m
              provider: azure
              ref:
                tag: latest
              url: oci://altinncr.azurecr.io/ghcr.io/altinn/altinn-platform/kustomize/dis-apim-operator
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.metrics_server_configmap will be destroyed
  # (because kubectl_manifest.metrics_server_configmap is not in configuration)
  - resource "kubectl_manifest" "metrics_server_configmap" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/kube-system/configmaps/metrics-server-config" -> null
      - kind                    = "ConfigMap" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "7ded0a58-ff1b-400d-beeb-885c3cbbd3e0" -> null
      - name                    = "metrics-server-config" -> null
      - namespace               = "kube-system" -> null
      - server_side_apply       = false -> null
      - uid                     = "7ded0a58-ff1b-400d-beeb-885c3cbbd3e0" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              NannyConfiguration: |-
                apiVersion: nannyconfig/v1alpha1
                kind: NannyConfiguration
                baseCPU: 100m
                cpuPerNode: 1m
                baseMemory: 100Mi
                memoryPerNode: 8Mi
            kind: ConfigMap
            metadata:
              labels:
                addonmanager.kubernetes.io/mode: EnsureExists
                kubernetes.io/cluster-service: "true"
              name: metrics-server-config
              namespace: kube-system
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # module.aks.azurerm_kubernetes_cluster_extension.flux will be created
  + resource "azurerm_kubernetes_cluster_extension" "flux" {
      + aks_assigned_identity  = (known after apply)
      + cluster_id             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + configuration_settings = {
          + "autoUpgradeMinorVersion" = "true"
          + "multiTenancy.enforce"    = "false"
          + "useKubeletIdentity"      = "true"
        }
      + current_version        = (known after apply)
      + extension_type         = "microsoft.flux"
      + id                     = (known after apply)
      + name                   = "flux"
      + release_namespace      = (known after apply)
      + release_train          = (known after apply)
      + target_namespace       = (known after apply)
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "AKS-Diagnostics"
      + storage_account_id             = (known after apply)
      + target_resource_id             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"

      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }

  # module.aks.azurerm_storage_account.aks_log is tainted, so must be replaced
-/+ resource "azurerm_storage_account" "aks_log" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-monitor-rg/providers/Microsoft.Storage/storageAccounts/admintestakslog31a076" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "admintestakslog31a076"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://admintestakslog31a076.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "admintestakslog31a076.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://admintestakslog31a076.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "admintestakslog31a076.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://admintestakslog31a076.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "admintestakslog31a076.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "norwayeast" -> (known after apply)
      ~ primary_queue_endpoint             = "https://admintestakslog31a076.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "admintestakslog31a076.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://admintestakslog31a076.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "admintestakslog31a076.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://admintestakslog31a076.z1.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "admintestakslog31a076.z1.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      - tags                               = {} -> null
        # (22 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # module.aks_resources.azapi_resource.cert_manager will be created
  + resource "azapi_resource" "cert_manager" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + cert-manager = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/cert-manager"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "cert-manager"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.container_runtime_aks_config will be created
  + resource "azapi_resource" "container_runtime_aks_config" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aks-config-ama            = {
                      + force                  = false
                      + path                   = "./ama/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + aks-config-metrics-server = {
                      + force                  = false
                      + path                   = "./metrics-server/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/container-runtime-aks-config"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "container-runtime-aks-config"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.flux_syncroot will be created
  + resource "azapi_resource" "flux_syncroot" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + syncroot = {
                      + force                  = false
                      + path                   = "./test"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                }
              + namespace                  = "admin"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "test"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/admin/syncroot"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = false
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "syncroot-admin-test"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.grafana_manifests[0] will be created
  + resource "azapi_resource" "grafana_manifests" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-manifests = {
                      + force                  = false
                      + path                   = "./dashboards/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-manifests"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "grafana-manifests"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.grafana_operator[0] will be created
  + resource "azapi_resource" "grafana_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-operator             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + GRAFANA_ADMIN_APIKEY = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + grafana-operator-post-deploy = {
                      + dependsOn              = [
                          + "grafana-operator",
                        ]
                      + force                  = false
                      + path                   = "./post-deploy/"
                      + postBuild              = {
                          + substitute = {
                              + EXTERNAL_GRAFANA_URL = "https://altinn-grafana-test-b2b8dpdkcvfuhfd3.eno.grafana.azure.com"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "grafana-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.linkerd will be created
  + resource "azapi_resource" "linkerd" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + linkerd             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISABLE_IPV6 = "false"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                  + linkerd-post-deploy = {
                      + dependsOn              = [
                          + "linkerd",
                        ]
                      + force                  = true
                      + path                   = "./post-deploy/"
                      + prune                  = true
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 31557600
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/linkerd"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "linkerd"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.otel_collector will be created
  + resource "azapi_resource" "otel_collector" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-collector = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = (known after apply)
                              + KV_URI    = (known after apply)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-collector"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "otel-collector"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.otel_operator will be created
  + resource "azapi_resource" "otel_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "otel-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.aks_resources.azapi_resource.traefik will be created
  + resource "azapi_resource" "traefik" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + traefik = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AKS_NODE_RG              = "MC_admin-test-rg_admin-test-aks_norwayeast"
                              + AKS_SYSP00L_IP_PREFIX_0  = "fdac:524d:afaf:1::/64"
                              + AKS_SYSP00L_IP_PREFIX_1  = "10.90.1.0/24"
                              + AKS_WORKPOOL_IP_PREFIX_0 = "fdac:524d:afaf:2::/64"
                              + AKS_WORKPOOL_IP_PREFIX_1 = "10.90.2.0/24"
                              + PUBLIC_IP_V4             = "20.251.137.126"
                              + PUBLIC_IP_V6             = "2603:1020:e01:4::e5"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/traefik"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "traefik"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "admin-test-otel-collector"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.observability.azuread_application_federated_identity_credential.obs_fed_identity will be created
  + resource "azuread_application_federated_identity_credential" "obs_fed_identity" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "The federated identity used to federate K8s with Azure AD for admin-test-otel"
      + display_name   = "fed-identity-admin-test-obs"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/92049459-fc39-4ae6-8fed-b7baaa092379/"
      + subject        = "system:serviceaccount:monitoring:otel-collector"
    }

  # module.observability.azuread_application_password.app will be created
  + resource "azuread_application_password" "app" {
      + application_id      = (known after apply)
      + display_name        = (known after apply)
      + end_date            = (known after apply)
      + id                  = (known after apply)
      + key_id              = (known after apply)
      + rotate_when_changed = (known after apply)
      + start_date          = (known after apply)
      + value               = (sensitive value)
    }

  # module.observability.azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.observability.azuread_service_principal_password.sp will be created
  + resource "azuread_service_principal_password" "sp" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + rotate_when_changed  = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.observability.azurerm_application_insights.obs will be created
  + resource "azurerm_application_insights" "obs" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "admin-test-obs-appinsights"
      + resource_group_name                 = "admin-test-obs-rg"
      + retention_in_days                   = 30
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be created
  + resource "azurerm_key_vault" "obs_kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "admin-test-obs-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = (sensitive value)
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.observability.azurerm_log_analytics_workspace.obs will be created
  + resource "azurerm_log_analytics_workspace" "obs" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "admin-test-obs-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "admin-test-obs-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.observability.azurerm_monitor_data_collection_endpoint.amw[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "amw" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "norwayeast"
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "admin-test-obs-amw-mdce"
      + public_network_access_enabled = true
      + resource_group_name           = "admin-test-obs-rg"
    }

  # module.observability.azurerm_monitor_data_collection_rule.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "amw" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "norwayeast"
      + name                        = "admin-test-obs-amw-mdcr"
      + resource_group_name         = "admin-test-obs-rg"

      + data_flow {
          + destinations = [
              + "admin-test-obs-amw",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "admin-test-obs-amw"
            }
        }
    }

  # module.observability.azurerm_monitor_data_collection_rule_association.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "amw" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "admin-test-obs-amw-mdcra"
      + target_resource_id      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
    }

  # module.observability.azurerm_monitor_workspace.obs will be created
  + resource "azurerm_monitor_workspace" "obs" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "admin-test-obs-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "admin-test-obs-rg"
    }

  # module.observability.azurerm_resource_group.obs will be created
  + resource "azurerm_resource_group" "obs" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "admin-test-obs-rg"
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role will be created
  + resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.azurerm_role_assignment.obs_kv_reader will be created
  + resource "azurerm_role_assignment" "obs_kv_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.random_string.obs_kv_postfix will be created
  + resource "random_string" "obs_kv_postfix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.observability.time_rotating.password will be created
  + resource "time_rotating" "password" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 32 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`